# ShowDialog Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
IIFCEntityTreeUIServer..::..ShowDialog Method
IIFCEntityTreeUIServer Interface See Also
---
Shows dialog on managing IFCEntityTreeUI.
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2023
# Syntax
C#
---
```text
bool ShowDialog(
	IFCExternalServiceUIData data
)
```

Visual Basic
---
```text
Function ShowDialog ( _
	data As IFCExternalServiceUIData _
) As Boolean
```

Visual C++
---
```text
bool ShowDialog(
	IFCExternalServiceUIData^ data
)
```

# ### Parameters
data
    Type: Autodesk.Revit.UI..::..IFCExternalServiceUIData The data on initializing the dialog as well as getting the result.
# ### Return Value
Whether or not the dialog launches successfully
# See Also
IIFCEntityTreeUIServer Interface
Autodesk.Revit.UI Namespace